[
  "May 7, 2025",
  "Unlock your dreams with ComBank Personal Loans",
  "Content Bigger Text Bigger Cursor Readable Font Colors Invert Colors Brightness Contrast Grayscale Dark / Light Navigation Highlight Links Read Page",
  "‹",
  "Flash is the fully fledged digital bank account introduced by Commercial Bank. Enjoy a complete suite of financial services and wealth management tools in one seamless application with the Flash Digital Bank Account.",
  "Upto 25% Discount for Credit & Debit card holders Enjoy the art of dining at your favourite restaurant with ComBank Credit and Debit Cards View All Offers More Info Upto 35% Discount for Credit & Debit card holders Relax at your favourite hotel with ComBank Credit and Debit Cards View All Offers More Info Easy Payment Plans Great online deals at SriLankan Airlines for travel with ComBank Credit Cards View All Offers More Info ‹ ›",
  "Readable Font",
  "ComBank Cards provide you access to a wide range of discounts and  easy payment facilities . Shop conveniently and securely with our Credit and Debit Cards.",
  "ComBank supports first Sri Lanka – New Zealand Rugby series in 70 year...",
  "Classic Debit Cards Makes your life easy More Info",
  "Tools & Calculator Rewards & Promotion Rates & Tariffs Exchange Rates Applications Important Notices",
  "Call us to Talk to an Advisor",
  "Earn a higher return for your funds with Fixed Deposits",
  "The Commercial Bank of Ceylon has announced its support for accelerating the transition in Sri Lanka to new energy vehicles by launching a collaborati...",
  "Dedicated, Resilient, Diligent",
  "Investments Put your money to work and earn a higher return Tell Me More Apply Now",
  "Brightness",
  "Be your own bank",
  "May 19, 2025",
  "Loans",
  "Read Page",
  "Invert Colors",
  "Making your dreams a reality has never been this easy.",
  "25%",
  "Savings Accounts We offer  you a variety of Savings Accounts to choose from.\nBased on your needs, you can select an account that helps you save while you earn. Main Accounts A selection of Savings Accounts with flexibility to suite your lifestyle. Tell Me More Apply Now Senior Citizens Accounts Exclusive accounts for Senior Citizens to provide attractive interest rates coupled with convenience. Tell Me More Apply Now Minor and Youth Accounts Save today for your children to give them a brighter tomorrow Tell Me More Apply Now",
  "Earn a higher return for your funds with Fixed Deposits Tell Me More Apply Now",
  "ComBank first SL bank to open Representative Office in Dubai Internati...",
  "Deposits We offer you a range of deposit products to suit your requirement. With attractive interest rates on offer, you can watch you money grow day by day. Fixed Deposits Earn a higher return for your funds with Fixed Deposits Tell Me More Apply Now Investments Put your money to work and earn a higher return Tell Me More Apply Now Other Deposits Other Deposits Tell Me More Apply Now",
  "Ensure the safety of your funds whilst enjoying unlimited transactions and many other benefits. Tell Me More Apply Now",
  "Visa Infinite Card A range of privileges at your disposal More Info",
  "Tell Me More Apply Now",
  "Savings Accounts We offer  you a variety of Savings Accounts to choose from.\nBased on your needs, you can select an account that helps you save while you earn. Main Accounts A selection of Savings Accounts with flexibility to suite your lifestyle. Tell Me More Apply Now Senior Citizens Accounts Exclusive accounts for Senior Citizens to provide attractive interest rates coupled with convenience. Tell Me More Apply Now Minor and Youth Accounts Save today for your children to give them a brighter tomorrow Tell Me More Apply Now Deposits We offer you a range of deposit products to suit your requirement. With attractive interest rates on offer, you can watch you money grow day by day. Fixed Deposits Earn a higher return for your funds with Fixed Deposits Tell Me More Apply Now Investments Put your money to work and earn a higher return Tell Me More Apply Now Other Deposits Other Deposits Tell Me More Apply Now Current Accounts Our current accounts give you the convenience of managing your day to day business transactions with ease. Current Accounts Ensure the safety of your funds whilst enjoying unlimited transactions and many other benefits. Tell Me More Apply Now Cards ComBank Cards provide you access to a wide range of discounts and  easy payment facilities . Shop conveniently and securely with our Credit and Debit Cards. Premium Credit Cards Enter a world of exclusive benefits. Tell Me More Apply Now Credit Cards Own anything, any time any where with a ComBank Credit Card. Tell Me More Apply Now Debit Cards Safe and convenient alternative to cash. Tell Me More Apply Now Loans Now you no longer need to put your dreams on hold. We offer you the perfect loan packages tailored to suit your income and repayment capacity, to make them come true. Home Loans The first step for a Home of your own. Tell Me More Apply Now Personal Loans Making your dreams a reality has never been this easy. Tell Me More Apply Now Gold Loans Pawning Best value for your jewelery at the lowest interest rates. Tell Me More Apply Now",
  "Easy Payment Plans Great online deals at SriLankan Airlines for travel with ComBank Credit Cards View All Offers More Info",
  "Receives Dubai Financial Services Authority (DFSA) licenceSays presence in DIFC lays foundation for expansion of international footprintRepresentative...",
  "Calculators",
  "Use the ComBank Debit Card for fast and easy payments",
  "A selection of Savings Accounts with flexibility to suite your lifestyle.",
  "ComBank Personal Banking",
  "ComBank goes east to Vavunathivu for second Agri Modernisation Village...",
  "Get ready for exclusive loan options tailored just for you !",
  "Other Deposits Tell Me More Apply Now",
  "Current Accounts Ensure the safety of your funds whilst enjoying unlimited transactions and many other benefits. Tell Me More Apply Now",
  "Fixed Deposits",
  "Best value for your jewelery at the lowest interest rates. Tell Me More Apply Now",
  "Track Remittances",
  "Upto 35% Discount for Credit & Debit card holders Relax at your favourite hotel with ComBank Credit and Debit Cards View All Offers More Info",
  "Apply for Select One Savings Accounts Deposits Current Accounts Loans Other Services",
  "Latest News May 26, 2025 ComBank and MD/CEO Sanath Manatunge clinch top honours as ‘Sri Lanka’s... The Commercial Bank of Ceylon and its Managing Director/CEO Mr Sanath Manatunge have been named the ‘Best Managed Bank’ and the ‘Best Bank CEO’ in Sri... May 19, 2025 ComBank goes east to Vavunathivu for second Agri Modernisation Village... The Commercial Bank of Ceylon has chosen Vavunathivu in the Batticaloa District as its second ‘Agri Modernisation Village’ in Sri Lanka, following the... May 16, 2025 ComBank wins ‘Best Cross Border Salience – LMM’  award from Visa The Commercial Bank of Ceylon has been honoured with the award for ‘Best Cross Border Salience – Large & Mid Market’ at the Visa Commercial Soluti... May 14, 2025 ComBank ends Q1 as first private sector banking group on the cusp of R... Loan book grows by Rs 116.75 Bn. in 3 months to Rs 1.642 Tn.Net interest income up 23.53% to Rs 34.21 Bn.Improves provision cover and interest margin... May 7, 2025 ComBank promotes new energy vehicles via leasing promo with  Evolution... The Commercial Bank of Ceylon has announced its support for accelerating the transition in Sri Lanka to new energy vehicles by launching a collaborati... May 2, 2025 ComBank first SL bank to open Representative Office in Dubai Internati... Receives Dubai Financial Services Authority (DFSA) licenceSays presence in DIFC lays foundation for expansion of international footprintRepresentative... May 2, 2025 ComBank supports first Sri Lanka – New Zealand Rugby series in 70 year... The Commercial Bank of Ceylon has pledged its support for New Zealand’s Under 85KG Rugby Team Tour of Sri Lanka in May 2025, as the Co-sponsor of the... Apr 4, 2025 ComBank hosts 3rd SME Trade Fair in Colombo to support entrepreneurs Nearly 200 entrepreneurs representing small and medium enterprises (SMEs) from all over Sri Lanka came together in Colombo recently to exhibit and sel... Apr 24, 2025 ComBank partners ACH to facilitate overseas education for Sri Lankans Students aspiring for overseas education can now avail of opportunities available and raise the needed funds with ease, as a result of a collaboration... Apr 23, 2025 ComBank adjudged ‘Best Bank in Sri Lanka’ by Global Finance for 23rd y... The Commercial Bank of Ceylon has once again been recognised as the ‘Best Bank in Sri Lanka’ by the US-based Global Finance magazine, conferring this... Read all",
  "Navigation Highlight Links Read Page",
  "ComBank Credit and Debit Cards",
  "ComBank partners ACH to facilitate overseas education for Sri Lankans",
  "Rewards & Promotion",
  "ComBank hosts 3rd SME Trade Fair in Colombo to support entrepreneurs",
  "Rate us Your feedback Visit us in Your local branch Call us to Talk to an Advisor",
  "Bigger Text",
  "Credit and Debit Cards",
  "Tools & Calculator",
  "If you`d like more help & information, you can:",
  "What can we help you with today?",
  "Making your dreams a reality has never been this easy. Tell Me More Apply Now",
  "ePassbook",
  "The Commercial Bank of Ceylon and its Managing Director/CEO Mr Sanath Manatunge have been named the ‘Best Managed Bank’ and the ‘Best Bank CEO’ in Sri...",
  "Ensure the safety of your funds whilst enjoying unlimited transactions and many other benefits.",
  "ComBank With ComBank App you can install multiple Apps of Commercial Bank with just one click. Simply register for the Apps you need and experience a  variety of banking services through your mobile. Tell Me More",
  "Dark / Light",
  "Savings Accounts",
  "A selection of Savings Accounts with flexibility to suite your lifestyle. Tell Me More Apply Now",
  "With ePassbook you can get the transactions and balances of all your accounts and  ComBank Credit Cards online real time.",
  "Nearly 200 entrepreneurs representing small and medium enterprises (SMEs) from all over Sri Lanka came together in Colombo recently to exhibit and sel...",
  "Business Loans",
  "Main Accounts A selection of Savings Accounts with flexibility to suite your lifestyle. Tell Me More Apply Now",
  "Q+ Payment App You can make payments simply by scanning a QR code or by tapping on the name of the merchant on your mobile screen with Q+ payment App. It’s the fastest and the easiest way to make payments digitally through your mobile phone. Tell Me More",
  "Best value for your jewelery at the lowest interest rates.",
  "Personal Loans Making your dreams a reality has never been this easy. Tell Me More Apply Now",
  "ComBank Credit Cards",
  "Navigation",
  "Call us to",
  "Self-Registration Portal Track Remittances Credit Card Payments Prepaid Card Balance",
  "Oops! Something went wrong. Please try again later!",
  "ComBank wins ‘Best Cross Border Salience – LMM’  award from Visa",
  "Exclusive accounts for Senior Citizens to provide attractive interest rates coupled with convenience. Tell Me More Apply Now",
  "Current Accounts",
  "Q+ Payment App",
  "Debit Cards",
  "Contact",
  "The Commercial Bank of Ceylon has chosen Vavunathivu in the Batticaloa District as its second ‘Agri Modernisation Village’ in Sri Lanka, following the...",
  "Highlight Links",
  "Update your browser to view this website correctly. Outdated Browser",
  "Savings Accounts Deposits Current Accounts Cards Loans",
  "Loan book grows by Rs 116.75 Bn. in 3 months to Rs 1.642 Tn.Net interest income up 23.53% to Rs 34.21 Bn.Improves provision cover and interest margin...",
  "Fixed Deposits Earn a higher return for your funds with Fixed Deposits Tell Me More Apply Now",
  "Credit Card Payments",
  "ComBank Digital ComBank Digital ComBank Digital is the latest online Banking platform of Commercial Bank which comes with state of the art security enhancements & new features to carry out a multitude of banking transactions. Tell Me More",
  "Flash Digital Bank Account Flash Digital Bank Account Flash is the fully fledged digital bank account introduced by Commercial Bank. Enjoy a complete suite of financial services and wealth management tools in one seamless application with the Flash Digital Bank Account. Tell Me More",
  "Our current accounts give you the convenience of managing your day to day business transactions with ease.",
  "ComBank ComBank With ComBank App you can install multiple Apps of Commercial Bank with just one click. Simply register for the Apps you need and experience a  variety of banking services through your mobile. Tell Me More ComBank Digital ComBank Digital ComBank Digital is the latest online Banking platform of Commercial Bank which comes with state of the art security enhancements & new features to carry out a multitude of banking transactions. Tell Me More Flash Digital Bank Account Flash Digital Bank Account Flash is the fully fledged digital bank account introduced by Commercial Bank. Enjoy a complete suite of financial services and wealth management tools in one seamless application with the Flash Digital Bank Account. Tell Me More Q+ Payment App Q+ Payment App You can make payments simply by scanning a QR code or by tapping on the name of the merchant on your mobile screen with Q+ payment App. It’s the fastest and the easiest way to make payments digitally through your mobile phone. Tell Me More eSlip eSlip You no longer need to fill lengthy slips to make your cash and cheque deposits. You can digitally fill the e-slips on the app for cash deposits or capture an image of the cheque for cheque deposits before arriving at the Bank. Tell Me More RemitPlus RemitPlus Safe, fast, convenient and low cost, online money transfer system for Sri Lankans residing overseas to send money to their loved ones at home. Tell Me More ePassbook ePassbook With ePassbook you can get the transactions and balances of all your accounts and  ComBank Credit Cards online real time. Tell Me More",
  "Rate us Your feedback",
  "35%",
  "Content",
  "ComBank Digital",
  "Own anything, any time any where with a ComBank Credit Card.",
  "You no longer need to fill lengthy slips to make your cash and cheque deposits. You can digitally fill the e-slips on the app for cash deposits or capture an image of the cheque for cheque deposits before arriving at the Bank.",
  "Personal Loans",
  "The Commercial Bank of Ceylon has once again been recognised as the ‘Best Bank in Sri Lanka’ by the US-based Global Finance magazine, conferring this...",
  "Accessibility Options Content Bigger Text Bigger Cursor Readable Font Colors Invert Colors Brightness Contrast Grayscale Dark / Light Navigation Highlight Links Read Page Reset Settings",
  "Self-Registration Portal",
  "Gold / Silver Credit Cards",
  "Cards",
  "Accessibility Options",
  "Upto",
  "You can make payments simply by scanning a QR code or by tapping on the name of the merchant on your mobile screen with Q+ payment App. It’s the fastest and the easiest way to make payments digitally through your mobile phone.",
  "May 16, 2025",
  "May 26, 2025",
  "Fixed Deposits Earn a higher return for your funds with Fixed Deposits Tell Me More Apply Now Investments Put your money to work and earn a higher return Tell Me More Apply Now Other Deposits Other Deposits Tell Me More Apply Now",
  "Home Loans",
  "Bank anytime, anywhere  with ComBank Apps",
  "Gold Loans Pawning",
  "Discount for Credit & Debit card holders",
  "Anyone who Uses ComBank Digital Earns ComBank Max Rewards ComBank Digital, the first ever Digital Banking App in Sri Lanka that rewards you for your transactions. Tell Me More",
  "Gold / Silver Credit Cards Enjoy life to the fullest with a ComBank Credit Card. More Info Classic Debit Cards Makes your life easy More Info Visa Infinite Card A range of privileges at your disposal More Info",
  "›",
  "Unlock your dreams with ComBank Personal Loans Get ready for exclusive loan options tailored just for you ! Tell Me More",
  "May 2, 2025",
  "Now you no longer need to put your dreams on hold. We offer you the perfect loan packages tailored to suit your income and repayment capacity, to make them come true.",
  "Upto 25% Discount for Credit & Debit card holders Enjoy the art of dining at your favourite restaurant with ComBank Credit and Debit Cards View All Offers More Info Upto 35% Discount for Credit & Debit card holders Relax at your favourite hotel with ComBank Credit and Debit Cards View All Offers More Info Easy Payment Plans Great online deals at SriLankan Airlines for travel with ComBank Credit Cards View All Offers More Info",
  "Select One Savings Accounts Deposits Current Accounts Loans Other Services",
  "Contrast",
  "Put your money to work and earn a higher return Tell Me More Apply Now",
  "Bigger Cursor",
  "Debit Cards Safe and convenient alternative to cash. Tell Me More Apply Now",
  "More Info",
  "Important Notices",
  "How can we help?",
  "Exchange Rates",
  "ComBank ComBank With ComBank App you can install multiple Apps of Commercial Bank with just one click. Simply register for the Apps you need and experience a  variety of banking services through your mobile. Tell Me More",
  "Home Loans The first step for a Home of your own. Tell Me More Apply Now",
  "Enjoy the art of dining at your favourite restaurant with",
  "Minor and Youth Accounts Save today for your children to give them a brighter tomorrow Tell Me More Apply Now",
  "Upto 25% Discount for Credit & Debit card holders",
  "Business Loans Now is the perfect time to kickstart the business of your dreams. Make the most, with the low SME interest rates with the Commercial Bank Diribala Development Loan to make your dreams a reality. Tell Me More",
  "ePassbook ePassbook With ePassbook you can get the transactions and balances of all your accounts and  ComBank Credit Cards online real time. Tell Me More",
  "Apr 23, 2025",
  "Credit Cards Own anything, any time any where with a ComBank Credit Card. Tell Me More Apply Now",
  "Current Accounts Our current accounts give you the convenience of managing your day to day business transactions with ease. Current Accounts Ensure the safety of your funds whilst enjoying unlimited transactions and many other benefits. Tell Me More Apply Now",
  "Enter a world of exclusive benefits. Tell Me More Apply Now",
  "We offer you a range of deposit products to suit your requirement. With attractive interest rates on offer, you can watch you money grow day by day.",
  "Classic Debit Cards",
  "Safe and convenient alternative to cash.",
  "May 14, 2025",
  "Rates & Tariffs",
  "ComBank Digital is the latest online Banking platform of Commercial Bank which comes with state of the art security enhancements & new features to carry out a multitude of banking transactions.",
  "Mail",
  "ComBank Personal Banking What can we help you with today? Apply for Select One Savings Accounts Deposits Current Accounts Loans Other Services Savings Accounts Deposits Current Accounts Cards Loans Savings Accounts We offer  you a variety of Savings Accounts to choose from.\nBased on your needs, you can select an account that helps you save while you earn. Main Accounts A selection of Savings Accounts with flexibility to suite your lifestyle. Tell Me More Apply Now Senior Citizens Accounts Exclusive accounts for Senior Citizens to provide attractive interest rates coupled with convenience. Tell Me More Apply Now Minor and Youth Accounts Save today for your children to give them a brighter tomorrow Tell Me More Apply Now Deposits We offer you a range of deposit products to suit your requirement. With attractive interest rates on offer, you can watch you money grow day by day. Fixed Deposits Earn a higher return for your funds with Fixed Deposits Tell Me More Apply Now Investments Put your money to work and earn a higher return Tell Me More Apply Now Other Deposits Other Deposits Tell Me More Apply Now Current Accounts Our current accounts give you the convenience of managing your day to day business transactions with ease. Current Accounts Ensure the safety of your funds whilst enjoying unlimited transactions and many other benefits. Tell Me More Apply Now Cards ComBank Cards provide you access to a wide range of discounts and  easy payment facilities . Shop conveniently and securely with our Credit and Debit Cards. Premium Credit Cards Enter a world of exclusive benefits. Tell Me More Apply Now Credit Cards Own anything, any time any where with a ComBank Credit Card. Tell Me More Apply Now Debit Cards Safe and convenient alternative to cash. Tell Me More Apply Now Loans Now you no longer need to put your dreams on hold. We offer you the perfect loan packages tailored to suit your income and repayment capacity, to make them come true. Home Loans The first step for a Home of your own. Tell Me More Apply Now Personal Loans Making your dreams a reality has never been this easy. Tell Me More Apply Now Gold Loans Pawning Best value for your jewelery at the lowest interest rates. Tell Me More Apply Now",
  "Applications",
  "ComBank wins 5 Golds including overall winner award at LankaPay Technnovation Awards Tell Me More",
  "Enter a world of exclusive benefits.",
  "Visa Infinite Card",
  "×",
  "Q+ Payment App Q+ Payment App You can make payments simply by scanning a QR code or by tapping on the name of the merchant on your mobile screen with Q+ payment App. It’s the fastest and the easiest way to make payments digitally through your mobile phone. Tell Me More",
  "ComBank",
  "Business Loans Now is the perfect time to kickstart the business of your dreams. Make the most, with the low SME interest rates with the Commercial Bank Diribala Development Loan to make your dreams a reality. Tell Me More Anyone who Uses ComBank Digital Earns ComBank Max Rewards ComBank Digital, the first ever Digital Banking App in Sri Lanka that rewards you for your transactions. Tell Me More Dedicated, Resilient, Diligent She is you. She is Anagi. Welcome to a world dedicated to you. Anagi from ComBank offers a range of exclusive products and services for women. Tell Me More ComBank wins 5 Golds including overall winner award at LankaPay Technnovation Awards Tell Me More Use the ComBank Debit Card for fast and easy payments Tell Me More Unlock your dreams with ComBank Personal Loans Get ready for exclusive loan options tailored just for you ! Tell Me More Business Loans Now is the perfect time to kickstart the business of your dreams. Make the most, with the low SME interest rates with the Commercial Bank Diribala Development Loan to make your dreams a reality. Tell Me More Anyone who Uses ComBank Digital Earns ComBank Max Rewards ComBank Digital, the first ever Digital Banking App in Sri Lanka that rewards you for your transactions. Tell Me More Dedicated, Resilient, Diligent She is you. She is Anagi. Welcome to a world dedicated to you. Anagi from ComBank offers a range of exclusive products and services for women. Tell Me More ComBank wins 5 Golds including overall winner award at LankaPay Technnovation Awards Tell Me More Use the ComBank Debit Card for fast and easy payments Tell Me More Unlock your dreams with ComBank Personal Loans Get ready for exclusive loan options tailored just for you ! Tell Me More ‹ ›",
  "Gold Loans Pawning Best value for your jewelery at the lowest interest rates. Tell Me More Apply Now",
  "Reset Settings",
  "Put your money to work and earn a higher return",
  "Great online deals at SriLankan Airlines for travel with ComBank Credit Cards View All Offers More Info",
  "The Commercial Bank of Ceylon has pledged its support for New Zealand’s Under 85KG Rugby Team Tour of Sri Lanka in May 2025, as the Co-sponsor of the...",
  "For online banking click here.",
  "Visit us in",
  "RemitPlus Safe, fast, convenient and low cost, online money transfer system for Sri Lankans residing overseas to send money to their loved ones at home. Tell Me More",
  "Safe and convenient alternative to cash. Tell Me More Apply Now",
  "Flash Digital Bank Account",
  "Apply for",
  "Exclusive accounts for Senior Citizens to provide attractive interest rates coupled with convenience.",
  "ComBank and MD/CEO Sanath Manatunge clinch top honours as ‘Sri Lanka’s...",
  "Your browser is out-of-date!",
  "Dedicated, Resilient, Diligent She is you. She is Anagi. Welcome to a world dedicated to you. Anagi from ComBank offers a range of exclusive products and services for women. Tell Me More",
  "Premium Credit Cards Enter a world of exclusive benefits. Tell Me More Apply Now",
  "Students aspiring for overseas education can now avail of opportunities available and raise the needed funds with ease, as a result of a collaboration...",
  "Business Loans Now is the perfect time to kickstart the business of your dreams. Make the most, with the low SME interest rates with the Commercial Bank Diribala Development Loan to make your dreams a reality. Tell Me More Anyone who Uses ComBank Digital Earns ComBank Max Rewards ComBank Digital, the first ever Digital Banking App in Sri Lanka that rewards you for your transactions. Tell Me More Dedicated, Resilient, Diligent She is you. She is Anagi. Welcome to a world dedicated to you. Anagi from ComBank offers a range of exclusive products and services for women. Tell Me More ComBank wins 5 Golds including overall winner award at LankaPay Technnovation Awards Tell Me More Use the ComBank Debit Card for fast and easy payments Tell Me More Unlock your dreams with ComBank Personal Loans Get ready for exclusive loan options tailored just for you ! Tell Me More Business Loans Now is the perfect time to kickstart the business of your dreams. Make the most, with the low SME interest rates with the Commercial Bank Diribala Development Loan to make your dreams a reality. Tell Me More Anyone who Uses ComBank Digital Earns ComBank Max Rewards ComBank Digital, the first ever Digital Banking App in Sri Lanka that rewards you for your transactions. Tell Me More Dedicated, Resilient, Diligent She is you. She is Anagi. Welcome to a world dedicated to you. Anagi from ComBank offers a range of exclusive products and services for women. Tell Me More ComBank wins 5 Golds including overall winner award at LankaPay Technnovation Awards Tell Me More Use the ComBank Debit Card for fast and easy payments Tell Me More Unlock your dreams with ComBank Personal Loans Get ready for exclusive loan options tailored just for you ! Tell Me More",
  "Colors",
  "‹ ›",
  "Main Accounts A selection of Savings Accounts with flexibility to suite your lifestyle. Tell Me More Apply Now Senior Citizens Accounts Exclusive accounts for Senior Citizens to provide attractive interest rates coupled with convenience. Tell Me More Apply Now Minor and Youth Accounts Save today for your children to give them a brighter tomorrow Tell Me More Apply Now",
  "Anyone who Uses ComBank Digital Earns ComBank Max Rewards",
  "Latest News",
  "RemitPlus",
  "ComBank ends Q1 as first private sector banking group on the cusp of R...",
  "eSlip",
  "View All Offers More Info",
  "Senior Citizens Accounts Exclusive accounts for Senior Citizens to provide attractive interest rates coupled with convenience. Tell Me More Apply Now",
  "eSlip You no longer need to fill lengthy slips to make your cash and cheque deposits. You can digitally fill the e-slips on the app for cash deposits or capture an image of the cheque for cheque deposits before arriving at the Bank. Tell Me More",
  "Upto 35% Discount for Credit & Debit card holders",
  "Grayscale",
  "Premium Credit Cards",
  "Apr 4, 2025",
  "Save today for your children to give them a brighter tomorrow Tell Me More Apply Now",
  "The first step for a Home of your own. Tell Me More Apply Now",
  "The Commercial Bank of Ceylon has been honoured with the award for ‘Best Cross Border Salience – Large & Mid Market’ at the Visa Commercial Soluti...",
  "Use the ComBank Debit Card for fast and easy payments Tell Me More",
  "Own anything, any time any where with a ComBank Credit Card. Tell Me More Apply Now",
  "Rate us",
  "View All Cards",
  "The first step for a Home of your own.",
  "ComBank promotes new energy vehicles via leasing promo with  Evolution...",
  "ComBank Digital ComBank Digital is the latest online Banking platform of Commercial Bank which comes with state of the art security enhancements & new features to carry out a multitude of banking transactions. Tell Me More",
  "Apr 24, 2025",
  "Senior Citizens Accounts",
  "Colors Invert Colors Brightness Contrast Grayscale Dark / Light",
  "Save today for your children to give them a brighter tomorrow",
  "Gold / Silver Credit Cards Enjoy life to the fullest with a ComBank Credit Card. More Info Classic Debit Cards Makes your life easy More Info Visa Infinite Card A range of privileges at your disposal More Info View All Cards",
  "Home Loans The first step for a Home of your own. Tell Me More Apply Now Personal Loans Making your dreams a reality has never been this easy. Tell Me More Apply Now Gold Loans Pawning Best value for your jewelery at the lowest interest rates. Tell Me More Apply Now",
  "Other Deposits",
  "Gold / Silver Credit Cards Enjoy life to the fullest with a ComBank Credit Card. More Info",
  "May 26, 2025 ComBank and MD/CEO Sanath Manatunge clinch top honours as ‘Sri Lanka’s... The Commercial Bank of Ceylon and its Managing Director/CEO Mr Sanath Manatunge have been named the ‘Best Managed Bank’ and the ‘Best Bank CEO’ in Sri... May 19, 2025 ComBank goes east to Vavunathivu for second Agri Modernisation Village... The Commercial Bank of Ceylon has chosen Vavunathivu in the Batticaloa District as its second ‘Agri Modernisation Village’ in Sri Lanka, following the... May 16, 2025 ComBank wins ‘Best Cross Border Salience – LMM’  award from Visa The Commercial Bank of Ceylon has been honoured with the award for ‘Best Cross Border Salience – Large & Mid Market’ at the Visa Commercial Soluti... May 14, 2025 ComBank ends Q1 as first private sector banking group on the cusp of R... Loan book grows by Rs 116.75 Bn. in 3 months to Rs 1.642 Tn.Net interest income up 23.53% to Rs 34.21 Bn.Improves provision cover and interest margin... May 7, 2025 ComBank promotes new energy vehicles via leasing promo with  Evolution... The Commercial Bank of Ceylon has announced its support for accelerating the transition in Sri Lanka to new energy vehicles by launching a collaborati... May 2, 2025 ComBank first SL bank to open Representative Office in Dubai Internati... Receives Dubai Financial Services Authority (DFSA) licenceSays presence in DIFC lays foundation for expansion of international footprintRepresentative... May 2, 2025 ComBank supports first Sri Lanka – New Zealand Rugby series in 70 year... The Commercial Bank of Ceylon has pledged its support for New Zealand’s Under 85KG Rugby Team Tour of Sri Lanka in May 2025, as the Co-sponsor of the... Apr 4, 2025 ComBank hosts 3rd SME Trade Fair in Colombo to support entrepreneurs Nearly 200 entrepreneurs representing small and medium enterprises (SMEs) from all over Sri Lanka came together in Colombo recently to exhibit and sel... Apr 24, 2025 ComBank partners ACH to facilitate overseas education for Sri Lankans Students aspiring for overseas education can now avail of opportunities available and raise the needed funds with ease, as a result of a collaboration... Apr 23, 2025 ComBank adjudged ‘Best Bank in Sri Lanka’ by Global Finance for 23rd y... The Commercial Bank of Ceylon has once again been recognised as the ‘Best Bank in Sri Lanka’ by the US-based Global Finance magazine, conferring this...",
  "Relax at your favourite hotel with ComBank",
  "Investments",
  "We offer  you a variety of Savings Accounts to choose from.\nBased on your needs, you can select an account that helps you save while you earn.",
  "Your browser is out-of-date! Update your browser to view this website correctly. Outdated Browser For online banking click here. ×",
  "ePassbook With ePassbook you can get the transactions and balances of all your accounts and  ComBank Credit Cards online real time. Tell Me More",
  "Welcome to a world dedicated to you. Anagi from ComBank offers a range of exclusive products and services for women.",
  "With ComBank App you can install multiple Apps of Commercial Bank with just one click. Simply register for the Apps you need and experience a  variety of banking services through your mobile.",
  "Cards ComBank Cards provide you access to a wide range of discounts and  easy payment facilities . Shop conveniently and securely with our Credit and Debit Cards. Premium Credit Cards Enter a world of exclusive benefits. Tell Me More Apply Now Credit Cards Own anything, any time any where with a ComBank Credit Card. Tell Me More Apply Now Debit Cards Safe and convenient alternative to cash. Tell Me More Apply Now",
  "Content Bigger Text Bigger Cursor Readable Font",
  "Relax at your favourite hotel with ComBank Credit and Debit Cards View All Offers More Info",
  "Flash Digital Bank Account Flash is the fully fledged digital bank account introduced by Commercial Bank. Enjoy a complete suite of financial services and wealth management tools in one seamless application with the Flash Digital Bank Account. Tell Me More",
  "She is you. She is Anagi.",
  "Premium Credit Cards Enter a world of exclusive benefits. Tell Me More Apply Now Credit Cards Own anything, any time any where with a ComBank Credit Card. Tell Me More Apply Now Debit Cards Safe and convenient alternative to cash. Tell Me More Apply Now",
  "Enjoy the art of dining at your favourite restaurant with ComBank Credit and Debit Cards View All Offers More Info",
  "Other Deposits Other Deposits Tell Me More Apply Now",
  "ComBank Digital, the first ever Digital Banking App in Sri Lanka that rewards you for your transactions.",
  "ComBank adjudged ‘Best Bank in Sri Lanka’ by Global Finance for 23rd y...",
  "Prepaid Card Balance",
  "Now is the perfect time to kickstart the business of your dreams. Make the most, with the low SME interest rates with the Commercial Bank Diribala Development Loan to make your dreams a reality.",
  "How can we help? If you`d like more help & information, you can: Rate us Your feedback Visit us in Your local branch Call us to Talk to an Advisor",
  "Tell Me More",
  "Choose the Card that fits you",
  "Easy Payment Plans",
  "Thank you for contacting us. We will get back to you as soon as possible!",
  "Credit Cards",
  "Deposits",
  "ComBank wins 5 Golds including overall winner award at LankaPay Technnovation Awards",
  "Branches/ATMs",
  "Main Accounts",
  "Loans Now you no longer need to put your dreams on hold. We offer you the perfect loan packages tailored to suit your income and repayment capacity, to make them come true. Home Loans The first step for a Home of your own. Tell Me More Apply Now Personal Loans Making your dreams a reality has never been this easy. Tell Me More Apply Now Gold Loans Pawning Best value for your jewelery at the lowest interest rates. Tell Me More Apply Now",
  "Minor and Youth Accounts",
  "Safe, fast, convenient and low cost, online money transfer system for Sri Lankans residing overseas to send money to their loved ones at home.",
  "eSlip eSlip You no longer need to fill lengthy slips to make your cash and cheque deposits. You can digitally fill the e-slips on the app for cash deposits or capture an image of the cheque for cheque deposits before arriving at the Bank. Tell Me More",
  "RemitPlus RemitPlus Safe, fast, convenient and low cost, online money transfer system for Sri Lankans residing overseas to send money to their loved ones at home. Tell Me More",
  "Visit us in Your local branch",
  "Upto 25% Discount for Credit & Debit card holders Enjoy the art of dining at your favourite restaurant with ComBank Credit and Debit Cards View All Offers More Info",
  "Great online deals at SriLankan Airlines for travel with",
  "Grayscale",
  "Exchange Rates",
  "Content Bigger Text Bigger Cursor Readable Font Colors Invert Colors Brightness Contrast Grayscale Dark / Light Navigation Highlight Links Read Page",
  "Readable Font",
  "Rate us",
  "Navigation",
  "Call us to",
  "Tools & Calculator Rewards & Promotion Rates & Tariffs Exchange Rates Applications Important Notices",
  "Call us to Talk to an Advisor",
  "Oops! Something went wrong. Please try again later!",
  "Colors Invert Colors Brightness Contrast Grayscale Dark / Light",
  "Rates & Tariffs",
  "Country Name and Address of the Bank BIC Code/Swift CCY Account Number 1 Australia Australia and New Zealand Banking Group Limited (ANZ) Melbourne, Australia www.anz.com.au ANZBAU3MXXX AUD 944306AUD00001 2 Canada Bank of Montreal 100, King Street West, 24th Floor,Toronto, No M5X 1A1, Canada www.bmo.com BOFMCAT2 CAD 31441044203 3 China Standard Chartered Bank 22nd Floor, Standard Chartered Tower, 201, Century Avenue, Pudong, Shanghai www.standardchartered.com SCBLCNSX CNY 501510533540 4 Denmark Nordea Bank Denmark A/S P.O. Box 850, DK-0900, Copenhagen, Denmark www.nordea.com NDEADKKK DKK 5000408909 5 Germany Commerz Bank AG ZTB BC Mitte 6.4, Mainzer Landstrasse 277-293, 60261, Frankfurt AM Main, Germany www.commerzbank.com COBADEFF EUR 400872103701 6 Germany Landesbank Baden - Württemberg 7032/H, am hauptbahnhof 2, D-70173, Stuttgart Germany www.lbbw.de SOLADEST EUR 2808451 7 Germany Standard Chartered Bank Data & Exposure Control, P.O. Box 110162, Theodor - Heuss - Allee 112, D60036, Frankfurt AM Main, Germany www.standardchartered.de SCBLDEF EUR EUR 18109406 18149205 8 Germany Unicredit Bank AG (Hypo Vereins Bank) D-80311, Muenchen, Germany. www.hypovereinsbank.de HYVEDEMM EUR 69101429 9 Hong Kong Standard Chartered Bank P.O. Box 21, 9th Floor, 4-4A, Des Voeux Road, Central Hong Kong www.standardchartered.de SCBLHKHH HKD CNY 41109468048 44709448344 10 India Indian Bank Corporate Office, PB No: 5555, 254-260, Avvai Shanmugam Salai, Royapettah, Chennai – 600 014 Note : Receipt of funds on \"Trade Transactions (Goods and Services)\" will only be accepted. IDIBINBB INR 7395219691 11 India Standard Chartered Bank - Mumbai Crescenzo, C38/39 , Bandra Kurla Complex Bandra (East) Block G Floor 7 Mumbai 400 051 www.sc.com/in Note : Receipt of funds on \"Trade Transactions (Goods and Services)\" will only be accepted. SCBLINBB INR 22205671264 12 Italy Banca Intesa BCI #2612, Head Office, Int'l Money Transfer Dept., Piazza Della Scala 6, 20121 Milan, Italy www.bancaintesa.it BCITITMM EUR 100100003820 13 Italy Banco Popolare Society Coperation Piazza Nogara 2, 37121, Verona, Italy www.bancopopolare.it BAPPIT22 EUR 400000082 14 Italy Unicredito Italiano SPA Viale, Mberto, Tupini, 180, 1-00144, Rome, Italy www.unicreditgroup.eu UNCRITMM EUR 09954268 15 Japan Standard Chartered Bank P.O. Box 9997, 21st Floor, Sanno Park, Tower 2-11-1, Nagata-cho,  Chiyoda-ku, Tokyo 100-6155, Japan www.standardchartered.com SCBLJPJT JPY 2168531110 16 Japan Sumitomo Mitsui Banking Corporation International Business Operations Dept., 1-5-3, Kudanminami, Chiyoda-ku, Tokyo, 102-0074 Japan www.smbc.co.jp SMBCJPJT JPY 4395 17 Korea Korea Exchange Bank 66 Euljiro, Chung -ku Seoul, Korea www.kbstar.com KOEXKRSE US$ 0963THR051080010 18 Korea Kookmin Bank 9-1, 2GA, Namdaemun - RO, Jung - GU, Seoul 100-703, Korea www.kbstar.com CZNBKRSE US$ 7598USD010 19 Korea Woori Bank No. 203 Hoehyeon-dong 1-ga Jung-gu Seoul, Korea www.wooribank.com HVBKKRSE US$ W1027001US 20 Netherlands Ing Bank N.V. P.O. Box 1800 1000 BV, Amsterdam, Netherlands www.Ing.com INGBNL2A EUR 0050908928 21 New Zealand ANZ Bank New Zealand Limited Wellington NZ www.anz.co.nz ANZBNZ22XXX NZD 944306NZD00001 22 Norway Den Norske Bank Stranden 21, 0021, Oslo, Norway. www.dnbnor.com DNBANOKK NOK 7002.02.04808 23 Singapore Citibank NA 3, Temasek Avenue, #14-00, Sennial Tower, Singapore 039190 www.citibank.com CITISGSG US$ GBP EUR 851122001 851122036 851122028 24 Singapore Oversea-Chinese Banking Corporation Limited No 65, Chulia Street OCBC Centre Singapore 049513 www.ocbc.com OCBCSGSG US$ SGD 503212862301 695703165001 25 Singapore Standard Chartered Bank P.O. Box 1901, 6, Battery Road, 7th Storey, Singapore 049909 www.standardchartered.com.sg SCBLSGSG SGD 109344561 26 Sweden Skandinaviska Enskilda Banken Utlandsreskontran Stockholm S 106 40, Sweden www.mb.seb.se ESSESESS SEK 52018529803 27 Switzerland UBS Switzerland A.G. P.O. Box CH-8098, Zurich, Switzerland www.ubs.com UBSWCHZH CHF 02300000085408050000W 28 United Arab Emirates Mashreq Bank P.O.Box 1250, Dubai, UAE www.mashreqbank.com BOMLAEAD AED 195511268 29 United Kingdom Standard Chartered Bank City Office, Branch No. 37, Grace Church Street, London EC3V OBX, UK www.standardchartered.com SCBLGB2L GBP 1804813401 30 United Kingdom Bank Of Ceylon ( UK) Limited 1, Devonshire Square, London EC2M 4WD BCEYGB2L GBP 88001377 31 United States of America Bank of America NT & SA International Deposit Services, 1850, Gateway BL VD, 6th Floor, Concord CA 94520, USA www.bankofamerica.com BOFAUS6S US$ 6290890098 32 United States of America Citi Bank 111, Wall Street, 19th Floor, New York 10043, USA www.citibank.com CITIUS33 US$ 36141446 33 United States of America Deutsche Bank Trust Company Americas P.O. Box 318, Church Street Station, New York, NY 10008, USA www.db.com BKTRUS33 US$ 4034566 33 United States of America JP Morgan Chase Bank Head Office, 270, Park Avenue, New York, NY 10017, USA www.jpmorganchase.com CHASUS33 US$ 400808625 34 United States of America Standard Chartered Bank One Madison Avenue, New York, NY 10010-3603, USA www.standardchartered.com SCBLUS33 US$ US$ 3582052360001 3582052360002 35 United States of America Wells Fargo Bank N.A. 11, Penn Plaza, 4th Floor, New York, NY 10038, USA www.wellsfargo.com PNBPUS3NNYC US$ 2000191002407",
  "Mail",
  "Brightness",
  "Contact",
  "Applications",
  "Read Page",
  "Correspondent Banks",
  "Your browser is out-of-date! Update your browser to view this website correctly. Outdated Browser For online banking click here. ×",
  "Invert Colors",
  "Highlight Links",
  "Update your browser to view this website correctly. Outdated Browser",
  "×",
  "Content Bigger Text Bigger Cursor Readable Font",
  "Reset Settings",
  "Calculators",
  "For online banking click here.",
  "Visit us in",
  "Accessibility Options Content Bigger Text Bigger Cursor Readable Font Colors Invert Colors Brightness Contrast Grayscale Dark / Light Navigation Highlight Links Read Page Reset Settings",
  "Rate us Your feedback",
  "Content",
  "How can we help? If you`d like more help & information, you can: Rate us Your feedback Visit us in Your local branch Call us to Talk to an Advisor",
  "Navigation Highlight Links Read Page",
  "Rewards & Promotion",
  "Thank you for contacting us. We will get back to you as soon as possible!",
  "Accessibility Options",
  "Rate us Your feedback Visit us in Your local branch Call us to Talk to an Advisor",
  "Bigger Text",
  "Your browser is out-of-date!",
  "Tools & Calculator",
  "Branches/ATMs",
  "If you`d like more help & information, you can:",
  "Colors",
  "Visit us in Your local branch",
  "Contrast",
  "Bigger Cursor",
  "Dark / Light",
  "Important Notices",
  "How can we help?",
  "Grayscale",
  "Exchange Rates",
  "Content Bigger Text Bigger Cursor Readable Font Colors Invert Colors Brightness Contrast Grayscale Dark / Light Navigation Highlight Links Read Page",
  "Thank you for choosing Commercial Bank. We value your feedback and are committed to providing you with the best possible banking experience.",
  "Complaints and Grievances",
  "Readable Font",
  "Rate us",
  "Navigation",
  "If you have any complaints or issues regarding any aspect of our services, we encourage you to reach out to us. We are committed to resolving your concerns in a fair, transparent, and timely manner.",
  "Call us to",
  "Tools & Calculator Rewards & Promotion Rates & Tariffs Exchange Rates Applications Important Notices",
  "Call us to Talk to an Advisor",
  "Oops! Something went wrong. Please try again later!",
  "Colors Invert Colors Brightness Contrast Grayscale Dark / Light",
  "Rates & Tariffs",
  "Mail",
  "Brightness",
  "Contact",
  "At Commercial Bank, we strive to provide you with exceptional service at all times. However, we understand that there may be instances where you may have concerns or complaints about the delivery of services. Your feedback is invaluable and it will certainly help us improve the services provided by us. If you have any complaints or issues regarding any aspect of our services, we encourage you to reach out to us. We are committed to resolving your concerns in a fair, transparent, and timely manner. You can lodge a complaint or concerns through any of the following channels. Visit a branch / department : You can visit any of our branches/ departments and speak to our staff at the branch / branch manager or the head of the department regarding your complaint or Online complaint form : Fill out and submit the online complaint form available on our corporate website: www.combank.lk/contact Kindly provide details about your concern, and we will investigate it promptly or Email : Send us an email to info@combank.net with details of your complaint. Our customer service team will acknowledge your email and work towards resolving your complaint or Phone : Call our 24X7 Contact Center hotline on +94 11 235 3353 and speak to one of our representatives and they will guide you through the complaint resolution process or Write : Write to us at; “Commercial House”, No 21, Sir Razik Fareed Mawatha, P.O. Box 856, Colombo 01. Sri Lanka. Or contact Chief Manager - Operations during business hours (8.30 am to 5.15 pm) on Tel: +94 11 248 6045 , who will take all efforts to resolve the complaint. Upon receiving your complaint, we will acknowledge it. Our goal is to resolve the complaint to your satisfaction within three working days. If this is not possible due to an unavoidable reason, we will write to you on the progress of the matter highlighted and thereafter, take steps to resolve the complaint within fourteen days. If you feel that your complaint has not been adequately addressed or if you are not satisfied with the resolution provided, you have the option to escalate your complaint to the below mentioned external dispute resolution schemes; You can direct your complaint to the Financial Consumer Relations Department (FCRD) of the Central Bank of Sri Lanka via email, post or fax using the specified format available in their website. Complaint reporting format can be accessed via https://www.cbsl.gov.lk/sites/default/files/fcrd_complaint_submission_form_e.pdf The Director Financial Consumer Relations Department (FCRD) Central Bank of Sri Lanka (CBSL) 30, Janadhipathi Mawatha, Colombo 01. Tel : +94 11 247 7966 Hotline for Inquiries: 1935 Fax : +94 11 247 7744 Email : fcrd@cbsl.lk Web : www.cbsl.gov.lk/en/fcrd Complaint Reporting Format >> You can seek the services of an independent Financial Ombudsman with regard to your complaint. You can contact the office of the Financial Ombudsman directly and the contact details are as follows. Complaint reporting format can be accessed via www.financialombudsman.lk/forms/FORMB.pdf The Financial Ombudsman, Office of the Financial Ombudsman - Sri Lanka 143 A, Vajira Road, Colombo 05 Sri Lanka. Tel : +94 11 259 5624 Fax : +94 11 259 5625 Email : fosril@sltnet.lk Web : www.financialombudsman.lk Complaint Reporting Format >> Thank you for choosing Commercial Bank. We value your feedback and are committed to providing you with the best possible banking experience.",
  "Applications",
  "Read Page",
  "Your browser is out-of-date! Update your browser to view this website correctly. Outdated Browser For online banking click here. ×",
  "Invert Colors",
  "Highlight Links",
  "Update your browser to view this website correctly. Outdated Browser",
  "×",
  "If you feel that your complaint has not been adequately addressed or if you are not satisfied with the resolution provided, you have the option to escalate your complaint to the below mentioned external dispute resolution schemes;",
  "Content Bigger Text Bigger Cursor Readable Font",
  "Reset Settings",
  "Calculators",
  "For online banking click here.",
  "Visit us in",
  "Accessibility Options Content Bigger Text Bigger Cursor Readable Font Colors Invert Colors Brightness Contrast Grayscale Dark / Light Navigation Highlight Links Read Page Reset Settings",
  "Rate us Your feedback",
  "Content",
  "How can we help? If you`d like more help & information, you can: Rate us Your feedback Visit us in Your local branch Call us to Talk to an Advisor",
  "Navigation Highlight Links Read Page",
  "Rewards & Promotion",
  "Thank you for contacting us. We will get back to you as soon as possible!",
  "Accessibility Options",
  "You can lodge a complaint or concerns through any of the following channels.",
  "Rate us Your feedback Visit us in Your local branch Call us to Talk to an Advisor",
  "Bigger Text",
  "Your browser is out-of-date!",
  "Complaint Reporting Format >>",
  "Branches/ATMs",
  "If you`d like more help & information, you can:",
  "Tools & Calculator",
  "Colors",
  "Visit us in Your local branch",
  "Upon receiving your complaint, we will acknowledge it. Our goal is to resolve the complaint to your satisfaction within three working days. If this is not possible due to an unavoidable reason, we will write to you on the progress of the matter highlighted and thereafter, take steps to resolve the complaint within fourteen days.",
  "Contrast",
  "At Commercial Bank, we strive to provide you with exceptional service at all times. However, we understand that there may be instances where you may have concerns or complaints about the delivery of services. Your feedback is invaluable and it will certainly help us improve the services provided by us.",
  "Bigger Cursor",
  "Dark / Light",
  "Important Notices",
  "How can we help?",
  "Grayscale",
  "Exchange Rates",
  "Content Bigger Text Bigger Cursor Readable Font Colors Invert Colors Brightness Contrast Grayscale Dark / Light Navigation Highlight Links Read Page",
  "Registering 'US persons' under Foreign Account Tax Compliance Act (FATCA)",
  "Readable Font",
  "Rate us",
  "Navigation",
  "Call us to",
  "Tools & Calculator Rewards & Promotion Rates & Tariffs Exchange Rates Applications Important Notices",
  "Call us to Talk to an Advisor",
  "Oops! Something went wrong. Please try again later!",
  "Colors Invert Colors Brightness Contrast Grayscale Dark / Light",
  "Rates & Tariffs",
  "FATCA was signed into law in 2010 by the US Government and came into effect in 2014.",
  "Mail",
  "If you /your entity fall within any category stated above at present you are advised to immediately contact your Branch Manager in order to complete the relevant forms.",
  "Brightness",
  "Contact",
  "Applications",
  "Read Page",
  "Your browser is out-of-date! Update your browser to view this website correctly. Outdated Browser For online banking click here. ×",
  "Invert Colors",
  "Highlight Links",
  "Foreign Account Tax Compliance Act",
  "Update your browser to view this website correctly. Outdated Browser",
  "×",
  "Content Bigger Text Bigger Cursor Readable Font",
  "Under the provisions of FATCA, a ‘US Person’ includes,",
  "Reset Settings",
  "Calculators",
  "For online banking click here.",
  "Visit us in",
  "Accessibility Options Content Bigger Text Bigger Cursor Readable Font Colors Invert Colors Brightness Contrast Grayscale Dark / Light Navigation Highlight Links Read Page Reset Settings",
  "Rate us Your feedback",
  "Content",
  "Further, if you /your entity change the status in future and qualify to be a ‘US Person’ as described above, you are advised to inform your Branch the status as mandated by FATCA regulations.",
  "How can we help? If you`d like more help & information, you can: Rate us Your feedback Visit us in Your local branch Call us to Talk to an Advisor",
  "Navigation Highlight Links Read Page",
  "Rewards & Promotion",
  "Thank you for contacting us. We will get back to you as soon as possible!",
  "Accessibility Options",
  "Commercial Bank of Ceylon PLC which is a registered Foreign Financial Institution ( FFI ) under FATCA is required to comply with the FATCA regulations and report to the Internal Revenue Service (IRS) of the USA.",
  "Rate us Your feedback Visit us in Your local branch Call us to Talk to an Advisor",
  "Bigger Text",
  "Your browser is out-of-date!",
  "Registering 'US persons' under Foreign Account Tax Compliance Act (FATCA) The Foreign Account Tax Compliance Act ( FATCA ) is a U.S.A. ( US ) legislation which requires ‘US Persons’ to report their financial assets held overseas. FATCA was signed into law in 2010 by the US Government and came into effect in 2014. Commercial Bank of Ceylon PLC which is a registered Foreign Financial Institution ( FFI ) under FATCA is required to comply with the FATCA regulations and report to the Internal Revenue Service (IRS) of the USA. Under the provisions of FATCA, a ‘US Person’ includes, A citizen of the U.S. ( including an individual born in the U.S. but resident in another country who has not renounced U.S. citizenship ) A lawful resident of the U.S. ( including a U.S. green card holder ) A person residing in the U.S. A person who spends a certain number of days in the U.S. each year. U.S. corporations, U.S. estates and U.S. trusts. Any entity that has a linkage or ownership to US or to US territories. Non-US entities that have at least one US person as a “Substantial Beneficial Owner.” If you /your entity fall within any category stated above at present you are advised to immediately contact your Branch Manager in order to complete the relevant forms. Should you require further details, please contact us by email at fatcainquiry@combank.net Further, if you /your entity change the status in future and qualify to be a ‘US Person’ as described above, you are advised to inform your Branch the status as mandated by FATCA regulations.",
  "Tools & Calculator",
  "The Foreign Account Tax Compliance Act ( FATCA ) is a U.S.A. ( US ) legislation which requires ‘US Persons’ to report their financial assets held overseas.",
  "If you`d like more help & information, you can:",
  "Branches/ATMs",
  "Colors",
  "Visit us in Your local branch",
  "Contrast",
  "Bigger Cursor",
  "Should you require further details, please contact us by email at fatcainquiry@combank.net",
  "Dark / Light",
  "Important Notices",
  "How can we help?",
  "Grayscale",
  "Exchange Rates",
  "Content Bigger Text Bigger Cursor Readable Font Colors Invert Colors Brightness Contrast Grayscale Dark / Light Navigation Highlight Links Read Page",
  "Readable Font",
  "Rate us",
  "Navigation",
  "Call us to",
  "Tools & Calculator Rewards & Promotion Rates & Tariffs Exchange Rates Applications Important Notices",
  "Call us to Talk to an Advisor",
  "Oops! Something went wrong. Please try again later!",
  "Colors Invert Colors Brightness Contrast Grayscale Dark / Light",
  "Rates & Tariffs",
  "Mail",
  "Brightness",
  "Contact",
  "Applications",
  "Read Page",
  "Your browser is out-of-date! Update your browser to view this website correctly. Outdated Browser For online banking click here. ×",
  "Invert Colors",
  "Highlight Links",
  "Update your browser to view this website correctly. Outdated Browser",
  "×",
  "Content Bigger Text Bigger Cursor Readable Font",
  "Reset Settings",
  "Calculators",
  "For online banking click here.",
  "Visit us in",
  "Accessibility Options Content Bigger Text Bigger Cursor Readable Font Colors Invert Colors Brightness Contrast Grayscale Dark / Light Navigation Highlight Links Read Page Reset Settings",
  "Rate us Your feedback",
  "Content",
  "How can we help? If you`d like more help & information, you can: Rate us Your feedback Visit us in Your local branch Call us to Talk to an Advisor",
  "Navigation Highlight Links Read Page",
  "Rewards & Promotion",
  "Thank you for contacting us. We will get back to you as soon as possible!",
  "Accessibility Options",
  "Rate us Your feedback Visit us in Your local branch Call us to Talk to an Advisor",
  "Bigger Text",
  "Your browser is out-of-date!",
  "Tools & Calculator",
  "Branches/ATMs",
  "If you`d like more help & information, you can:",
  "Colors",
  "Visit us in Your local branch",
  "Contrast",
  "Bigger Cursor",
  "Dark / Light",
  "Important Notices",
  "How can we help?",
  "Properties for Sale"
]