[
  "HNB FINANCE has been an immense strength to our lives HNB FINANCE has been our financial partner for over 10 years now. Therefore, we have been able do business according to so... I enjoy the benefit of obtaining money for the business while saving As I was able to get a loan without any guarantors through Swashakthi Savings, I was able to easily get the money I needed...",
  "January 31, 2024",
  "HNB FINANCE clinches Bronze at TAGS Awards 2023 December 12, 2023",
  "HNB FINANCE appoints Anura Pathirage to Board of Directors January 31, 2024 HNB FINANCE PLC appoints Mr Rajive Dissanayake as Chairman January 08, 2024 HNB FINANCE clinches Bronze at TAGS Awards 2023 December 12, 2023 HNB FINANCE appoints Dr. Prasad Samarasinghe to Board of Directors February 26, 2023 HNB FINANCE appoints Anura Pathirage to Board of Directors January 31, 2024 HNB FINANCE PLC appoints Mr Rajive Dissanayake as Chairman January 08, 2024 HNB FINANCE clinches Bronze at TAGS Awards 2023 December 12, 2023 HNB FINANCE appoints Dr. Prasad Samarasinghe to Board of Directors February 26, 2023 HNB FINANCE appoints Anura Pathirage to Board of Directors January 31, 2024 HNB FINANCE PLC appoints Mr Rajive Dissanayake as Chairman January 08, 2024 prev next",
  "February 26, 2023",
  "0 Branches",
  "Services That Offer You Convenience and Flexibility",
  "TAGS Awards",
  "Success Stories Our keen focus on entrepreneurs across the country enables us to boost SME & SSE communities to reach their full potential.",
  "News & Updates Read our latest news and updates. HNB FINANCE appoints Anura Pathirage to Board of Directors January 31, 2024 HNB FINANCE PLC appoints Mr Rajive Dissanayake as Chairman January 08, 2024 HNB FINANCE clinches Bronze at TAGS Awards 2023 December 12, 2023 HNB FINANCE appoints Dr. Prasad Samarasinghe to Board of Directors February 26, 2023 HNB FINANCE appoints Anura Pathirage to Board of Directors January 31, 2024 HNB FINANCE PLC appoints Mr Rajive Dissanayake as Chairman January 08, 2024 HNB FINANCE clinches Bronze at TAGS Awards 2023 December 12, 2023 HNB FINANCE appoints Dr. Prasad Samarasinghe to Board of Directors February 26, 2023 HNB FINANCE appoints Anura Pathirage to Board of Directors January 31, 2024 HNB FINANCE PLC appoints Mr Rajive Dissanayake as Chairman January 08, 2024 prev next",
  "HNB FINANCE appoints Dr. Prasad Samarasinghe to Board of Directors February 26, 2023",
  "Success Stories Our keen focus on entrepreneurs across the country enables us to boost SME & SSE communities to reach their full potential. HNB FINANCE has been an immense strength to our lives HNB FINANCE has been our financial partner for over 10 years now. Therefore, we have been able do business according to so... I enjoy the benefit of obtaining money for the business while saving As I was able to get a loan without any guarantors through Swashakthi Savings, I was able to easily get the money I needed...",
  "HNB FINANCE has been an immense strength to our lives HNB FINANCE has been our financial partner for over 10 years now. Therefore, we have been able do business according to so...",
  "HNB FINANCE appoints Anura Pathirage to Board of Directors January 31, 2024 HNB FINANCE PLC appoints Mr Rajive Dissanayake as Chairman January 08, 2024 HNB FINANCE clinches Bronze at TAGS Awards 2023 December 12, 2023 HNB FINANCE appoints Dr. Prasad Samarasinghe to Board of Directors February 26, 2023 HNB FINANCE appoints Anura Pathirage to Board of Directors January 31, 2024 HNB FINANCE PLC appoints Mr Rajive Dissanayake as Chairman January 08, 2024 HNB FINANCE clinches Bronze at TAGS Awards 2023 December 12, 2023 HNB FINANCE appoints Dr. Prasad Samarasinghe to Board of Directors February 26, 2023 HNB FINANCE appoints Anura Pathirage to Board of Directors January 31, 2024 HNB FINANCE PLC appoints Mr Rajive Dissanayake as Chairman January 08, 2024",
  "Products to Help You Grow",
  "prev",
  "Sri Lanka’s leading integrated financial service provider HNB Finance established a water purification system and renovated the Mohoththuwarama Pri...",
  "Strength Born of Strength",
  "HNB Finance is a subsidiary of Hatton National Bank PLC and continues to operate with an unblemished record of almost two decades as a leader in the finance industry with a diverse portfolio of financial products and services.",
  "HNB FINANCE PLC appoints Mr Rajive Dissanayake as Chairman",
  "0 Customers",
  "HNB FINANCE has been an immense strength to our lives",
  "Services That Offer You Convenience and Flexibility HNB Finance PLC Strength Born of Strength HNB Finance is a subsidiary of Hatton National Bank PLC and continues to operate with an unblemished record of almost two decades as a leader in the finance industry with a diverse portfolio of financial products and services. Products to Help You Grow Shaping your future with products that encourage growth Success Stories Our keen focus on entrepreneurs across the country enables us to boost SME & SSE communities to reach their full potential. HNB FINANCE has been an immense strength to our lives HNB FINANCE has been our financial partner for over 10 years now. Therefore, we have been able do business according to so... I enjoy the benefit of obtaining money for the business while saving As I was able to get a loan without any guarantors through Swashakthi Savings, I was able to easily get the money I needed... About Us A pioneering financial institution fuelled by a passionate team that aims to provide customer centric, well diversified products and services in a responsible and sustainable way. 0 Customers 0 Employees 0 Branches Mehewara CSR Projects The Mehewara fund is a series of ongoing CSR projects that helps our customers in need. The fund is maintained with the financial contribution of our dedicated employees and the organisation. HNB Finance creates an oasis in Mohoththuwarama Primary School Sri Lanka’s leading integrated financial service provider HNB Finance established a water purification system and renovated the Mohoththuwarama Pri... News & Updates Read our latest news and updates. HNB FINANCE appoints Anura Pathirage to Board of Directors January 31, 2024 HNB FINANCE PLC appoints Mr Rajive Dissanayake as Chairman January 08, 2024 HNB FINANCE clinches Bronze at TAGS Awards 2023 December 12, 2023 HNB FINANCE appoints Dr. Prasad Samarasinghe to Board of Directors February 26, 2023 HNB FINANCE appoints Anura Pathirage to Board of Directors January 31, 2024 HNB FINANCE PLC appoints Mr Rajive Dissanayake as Chairman January 08, 2024 HNB FINANCE clinches Bronze at TAGS Awards 2023 December 12, 2023 HNB FINANCE appoints Dr. Prasad Samarasinghe to Board of Directors February 26, 2023 HNB FINANCE appoints Anura Pathirage to Board of Directors January 31, 2024 HNB FINANCE PLC appoints Mr Rajive Dissanayake as Chairman January 08, 2024 prev next Great Place To Work Certified TAGS Awards",
  "Products to Help You Grow Shaping your future with products that encourage growth",
  "HNB FINANCE PLC appoints Mr Rajive Dissanayake as Chairman January 08, 2024",
  "HNB FINANCE has been our financial partner for over 10 years now. Therefore, we have been able do business according to so...",
  "January 08, 2024",
  "HNB FINANCE appoints Anura Pathirage to Board of Directors",
  "I enjoy the benefit of obtaining money for the business while saving As I was able to get a loan without any guarantors through Swashakthi Savings, I was able to easily get the money I needed...",
  "News & Updates",
  "Shaping your future with products that encourage growth",
  "Our keen focus on entrepreneurs across the country enables us to boost SME & SSE communities to reach their full potential.",
  "0",
  "December 12, 2023",
  "HNB Finance creates an oasis in Mohoththuwarama Primary School",
  "HNB FINANCE appoints Anura Pathirage to Board of Directors January 31, 2024",
  "0 Employees",
  "HNB Finance creates an oasis in Mohoththuwarama Primary School Sri Lanka’s leading integrated financial service provider HNB Finance established a water purification system and renovated the Mohoththuwarama Pri...",
  "Employees",
  "Success Stories",
  "Customers",
  "HNB Finance PLC Strength Born of Strength HNB Finance is a subsidiary of Hatton National Bank PLC and continues to operate with an unblemished record of almost two decades as a leader in the finance industry with a diverse portfolio of financial products and services.",
  "Mehewara CSR Projects The Mehewara fund is a series of ongoing CSR projects that helps our customers in need. The fund is maintained with the financial contribution of our dedicated employees and the organisation. HNB Finance creates an oasis in Mohoththuwarama Primary School Sri Lanka’s leading integrated financial service provider HNB Finance established a water purification system and renovated the Mohoththuwarama Pri...",
  "Mehewara CSR Projects",
  "HNB Finance PLC",
  "HNB FINANCE appoints Dr. Prasad Samarasinghe to Board of Directors",
  "A pioneering financial institution fuelled by a passionate team that aims to provide customer centric, well diversified products and services in a responsible and sustainable way.",
  "Read our latest news and updates.",
  "Mehewara CSR Projects The Mehewara fund is a series of ongoing CSR projects that helps our customers in need. The fund is maintained with the financial contribution of our dedicated employees and the organisation.",
  "Branches",
  "As I was able to get a loan without any guarantors through Swashakthi Savings, I was able to easily get the money I needed...",
  "HNB FINANCE clinches Bronze at TAGS Awards 2023",
  "About Us A pioneering financial institution fuelled by a passionate team that aims to provide customer centric, well diversified products and services in a responsible and sustainable way. 0 Customers 0 Employees 0 Branches",
  "next",
  "News & Updates Read our latest news and updates.",
  "The Mehewara fund is a series of ongoing CSR projects that helps our customers in need. The fund is maintained with the financial contribution of our dedicated employees and the organisation.",
  "About Us",
  "Great Place To Work Certified TAGS Awards",
  "0 Customers 0 Employees 0 Branches",
  "About Us A pioneering financial institution fuelled by a passionate team that aims to provide customer centric, well diversified products and services in a responsible and sustainable way.",
  "I enjoy the benefit of obtaining money for the business while saving",
  "prev next",
  "Great Place To Work Certified"
]